# Taller

En este taller trabajará con dos dataset  'title.csv' y 'cast.csv'. El archivo 'title.csv' contiene la lista de películas con el año de estreno; mientras que el archivo 'cast.csv' tiene cinco columnas que almacenan el título de la película, año de estreno, elenco de estrellas, tipo (actor / actriz), personajes y calificaciones de los actores, como se muestra a continuación,

In [1]:
#En esta celda se van a dejar  las librerías que usará a lo largo del taller
import pandas as pd

In [2]:
# Cargas los dos datasets

title = pd.read_csv("titles.csv")
cast = pd.read_csv("cast.csv")

In [3]:
title

                                        title  year
0                                      Mahler  1974
1                Ogon, voda i... mednye truby  1968
2       Ana Nojoom bent alasherah wamotalagah  2014
3                           Malu de Bicicleta  2010
4                  Nazareno Apostol: Boy Ahas  1989
...                                       ...   ...
230402                          El lobo negro  1981
230403                   Komu na Rusi zhit...  1989
230404                               Senotaji  2013
230405                      The Leopard Woman  1920
230406                     Mio caro assassino  1972

[230407 rows x 2 columns]

In [4]:
#Despliegue una muestra del dataset title (head, tail, sample)
title.head()

                                   title  year
0                                 Mahler  1974
1           Ogon, voda i... mednye truby  1968
2  Ana Nojoom bent alasherah wamotalagah  2014
3                      Malu de Bicicleta  2010
4             Nazareno Apostol: Boy Ahas  1989

In [5]:
title.tail()

                       title  year
230402         El lobo negro  1981
230403  Komu na Rusi zhit...  1989
230404              Senotaji  2013
230405     The Leopard Woman  1920
230406    Mio caro assassino  1972

In [6]:
title.sample(5)

                                           title  year
214070  Spirito Santo e le 5 magnifiche canaglie  1972
75884             Dang nan ren bian cheng nu ren  2002
201104                    Gli eroi di Fort Worth  1965
16819                                   Maa Baap  1944
197351                              Belali hayat  1968

In [7]:
#Despliegue una muestra del dataset cast  (head, tail, sample)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [8]:
cast.tail()

,title,year,name,type,character,n
3564645,Stuttur Frakki,1993,Sveinbj?rg ??rhallsd?ttir,actress,Flugfreyja,24.0
3564646,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0
3564647,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0
3564648,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0
3564649,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN

In [9]:
cast.sample(3)

,title,year,name,type,character,n
1689662,On Deadly Ground,1994,Bob (II) Pepper,actor,Oil Rig Worker,NaN
3311011,Knocking at Heaven's Door,1978,Carolyn Russell,actress,George's D-in-Law,NaN
2850961,You Tell Me,2006,Maren Hefler,actress,Reed,4.0

In [10]:
cast.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3564650 entries, 0 to 3564649
Data columns (total 6 columns):
 #   Column     Dtype
---  ------     -----
 0   title      object
 1   year       int64
 2   name       object
 3   type       object
 4   character  object
 5   n          float64
dtypes: float64(1), int64(1), object(4)
memory usage: 163.2+ MB

In [11]:
cast.columns

Index(['title', 'year', 'name', 'type', 'character', 'n'], dtype='object')

In [12]:
#Cuantos nomrbes de peliculas hay en title y cuantos son distintos
title.count()
#len(title)
#title.title.value_counts()

title    230407
year     230407
dtype: int64

In [13]:
len(title.title.unique())

210691

In [14]:
#len(set(title.title))
len(title.groupby('title').count())

210691

In [15]:
#Cuantas peliculas por año en el dataset titles y cuantas en el dataset cast
title.groupby(["year"])["title"].count()

year
1894      1
1898      1
1899      1
1900      4
1903      1
       ...
2020    104
2021     15
2022     12
2023     10
2024      1
Name: title, Length: 125, dtype: int64

In [16]:
cast.groupby(["year"])["title"].count()

year
1894      3
1900      2
1905      1
1906     17
1907      5
       ...
2019    262
2020    123
2021     22
2022     17
2023      1
Name: title, Length: 121, dtype: int64

In [17]:
# cuantas peliculas tienen por nombre "Hamlet"
Nombre_Hamlet= title[title['title'] == 'Hamlet']

In [18]:
Nombre_Hamlet.count()

title    19
year     19
dtype: int64

In [19]:
#Cuantas peliculas son de nombre "Carmen" y son de antes de 1950
Pelicula_Carmen = title[(title['title'] == 'Carmen') & (title['year'] <= 1950)]

In [20]:
Pelicula_Carmen.count()

title    8
year     8
dtype: int64

In [21]:
# Titulos mas comunes en la historia filmografica
title['title'].value_counts()

Hamlet                     19
Carmen                     16
Macbeth                    15
Hero                       11
Maya                       11
                           ..
Tenderfoot                  1
La bataille silencieuse     1
Cuernos de mujer            1
Vesyolyye Zhabokrichi       1
Animate My Heart            1
Name: title, Length: 210691, dtype: int64

In [22]:
# Cual fue la primer pelicula hecha titulada "Romeo and Juliet"
primera_pelicula_RJ = title[title['title'] == 'Romeo and Juliet']

In [23]:
primera_pelicula_RJ

                   title  year
16975   Romeo and Juliet  2014
82622   Romeo and Juliet  1936
87037   Romeo and Juliet  1954
124702  Romeo and Juliet  1916
144796  Romeo and Juliet  2013
147308  Romeo and Juliet  1947
185337  Romeo and Juliet  1968
196039  Romeo and Juliet  1966

In [24]:
primera_pelicula_RJ.iloc[3:4]

                   title  year
124702  Romeo and Juliet  1916

In [25]:
# Listar todas las peliculas que contengan la palabra "Exorcist" 
# ordenadas de la mas antigua a la mas reciente

In [26]:

title[title['title'].str.contains("Exorcist")].sort_values(['year'], ascending=[True,]),

(                                         title  year
 88003                             The Exorcist  1973
 49658                  O Exorcista de Mulheres  1974
 140519                Exorcist II: The Heretic  1977
 220073                        Kung Fu Exorcist  1978
 17375                         The Exorcist III  1990
 132451                        Teenage Exorcist  1991
 117797                 Exorcist: The Beginning  2004
 94189        Dominion: Prequel to the Exorcist  2005
 209250  Costa Chica: Confession of an Exorcist  2006
 86354                      Exorcist Chronicles  2007
 130686                      The Disco Exorcist  2011
 57932                      Exorcist Chronicles  2013
 69974                           Shark Exorcist  2015
 51101                            Bad Exorcists  2015
 151850                              Exorcistas  2015
 60700                      Accidental Exorcist  2016
 161093                       American Exorcist  2016
 195615                    Diary of an Exorcist  2016
 228642                  Exorcist House of Evil  2016,)

In [27]:
# Cuantas peliculas fueron hechas en el año 1950?

title.query("year == 1950").count()

title    1081
year     1081
dtype: int64

In [28]:
# Cuantas peliculas fueron despues del año 1970?
title.query("year > 1970").count()
#peliculas_D1970 = title[(title['year'] > 1970)]

title    164559
year     164559
dtype: int64

In [29]:
#peliculas_D1970.count()

In [30]:
# Cuantas peliculas fueron hechas de 1970 a 1979

In [31]:
title.loc[(title['year'] >= 1970) & (title['year'] <= 1979)].count()

title    18508
year     18508
dtype: int64

Ahora se trabajara con el dataset de cast, importante tambien tener en cuneta que e sun dataset que se tendra que limpiar con el paso de las clases y dejarlo lo mas optimo posible

In [32]:
cast.columns

Index(['title', 'year', 'name', 'type', 'character', 'n'], dtype='object')

In [49]:
The_Godfather = cast[(cast["title"]== "The Godfather")]

In [68]:
len(The_Godfather.character.unique())

75

In [74]:
# Cuantos roles o papeles hubo en la pelicula "The Godfather"


#Doy la solución a este punto para que vean que es lo que se pide

cast.loc[cast.title == "The Godfather"]

,title,year,name,type,character,n
51214,The Godfather,1972,Chris Anastasio,actor,Policeman,NaN
102809,The Godfather,1972,Norm Bacchiocchi,actor,Luca Brasi's Assassin,NaN
220852,The Godfather,1972,Rudy Bond,actor,Cuneo,15.0
248000,The Godfather,1972,Marlon Brando,actor,Don Vito Corleone,1.0
248738,The Godfather,1972,Max Brandt,actor,Extra in Furniture-Moving Scene,NaN
...,...,...,...,...,...,...
3137607,The Godfather,1972,Carol Morley,actress,Night Nurse,NaN
3360381,The Godfather,1972,Ardell Sheridan,actress,Mrs. Clemenza,29.0
3363276,The Godfather,1972,Talia Shire,actress,Connie,12.0
3390198,The Godfather,1972,Filomena Spagnuolo,actress,Extra in Wedding Scene,NaN
3399922,The Godfather,1972,Simonetta Stefanelli,actress,Apollonia - Sicilian Sequence,30.0

In [90]:
# Cuantos papeles en la pelicula "The Godfather" si estuvieron clasificados con un valor "n"

(The_Godfather.groupby(["character"])["n"].value_counts()).count()

34

In [141]:
# Mostrar el elenco completo de la pelicula "2001: A Space Odyssey" 
# ordenado por su clasificasión "n", ignorando los papeles que no se les asigno ningun valor "n"
Space_O = cast[(cast["title"] =="2001: A Space Odyssey")]
#cast.loc[(cast["title"]== "2001: A Space Odyssey")].loc[cast["name"]]

In [148]:
Space = Space_O[['name', "n"]]

In [150]:
Space.sort_values(by='n', ascending =False)

                       name     n
2359428  Richard (II) Woods  39.0
2343583         Bob Wilyman  38.0
2273687        Andy Wallace  37.0
1801551          Joe Refalo  36.0
1644362         Darryl Paes  35.0
1361809   Laurence Marchant  34.0
1329956        Scott MacKee  33.0
1074233     John (X) Jordan  32.0
1030910        Tony Jackson  31.0
954413          David Hines  30.0
916925         Brian Hawley  29.0
849029         Danny Grover  28.0
702077      David Fleetwood  27.0
601760         Terry Duggan  26.0
541763         P?ter Delm?r  25.0
515635         Jonathan Daw  24.0
514378          Simon Davis  23.0
373027       David Charkham  22.0
161571           Jimmy Bell  21.0
85047     John (III) Ashley  20.0
1302983         Mike Lovell  19.0
2690543     Heather Downham  18.0
2529579        Penny Brahms  17.0
2572025      Edwina Carroll  16.0
2787922          Ann Gillis  15.0
788106         Alan Gifford  14.0
153470           Glenn Beck  13.0
197975            Ed Bishop  12.0
2310523         Bill Weston  11.0
1469910        Frank Miller  10.0
1775057        Douglas Rain   9.0
2101643       Sean Sullivan   8.0
151781        Robert Beatty   7.0
3464754     Margaret Tyzack   6.0
1872093    Leonard Rossiter   5.0
1823947      Daniel Richter   4.0
2113186   William Sylvester   3.0
1288927       Gary Lockwood   2.0
602795          Keir Dullea   1.0
49363           Martin Amor   NaN
55115    S. Newton Anderson   NaN
413298        John Clifford   NaN
462887         Harold Coyne   NaN
1121087     Kenneth Kendall   NaN
1219287        Roy Lansford   NaN
1263965    Jordan (VI) Levy   NaN
1741274         Ivor Powell   NaN
1951234         Kevin Scott   NaN
2111934      John Swindells   NaN
2194992      Burnell Tucker   NaN
2970794      Vivian Kubrick   NaN
3028729       Maggie London   NaN
3068615          Irena Marr   NaN
3068626       Krystyna Marr   NaN
3080475     Chela Matthison   NaN

In [137]:
# Mostrar el elenco completo ordenado por la clasificacion "n"
# de la pelicula "Dracula" de 1958

dracula_1958 =cast.loc[(cast["title"]== "Dracula")].loc[cast["year"]==1958]

In [139]:
dracula_1958.sort_values(by='n', ascending =False)

,title,year,name,type,character,n
423307,Dracula,1958,Paul Cole,actor,Lad,17.0
148496,Dracula,1958,Geoffrey Bayldon,actor,Porter,16.0
1347640,Dracula,1958,Miles Malleson,actor,Undertaker,15.0
171732,Dracula,1958,George Benson,actor,Official,14.0
2357769,Dracula,1958,George Woodbridge,actor,Landlord,13.0
1453367,Dracula,1958,George Merritt,actor,Policeman,12.0
1285506,Dracula,1958,Charles Lloyd Pack,actor,Doctor Seward,11.0
2444220,Dracula,1958,Barbara Archer,actress,Inga,10.0
2731182,Dracula,1958,Janina Faye,actress,Tania,9.0
2777216,Dracula,1958,Valerie Gaunt,actress,Vampire Woman,8.0
2220986,Dracula,1958,John Van Eyssen,actor,Jonathan,7.0
2677557,Dracula,1958,Olga Dickie,actress,Gerda,6.0
3069196,Dracula,1958,Carol Marsh,actress,Lucy,5.0
3410427,Dracula,1958,Melissa Stribling,actress,Mina,4.0
822398,Dracula,1958,Michael Gough,actor,Arthur,3.0
1242308,Dracula,1958,Christopher Lee,actor,Count Dracula,2.0
1242307,Dracula,1958,Christopher Lee,actor,Dracula,2.0
485197,Dracula,1958,Peter Cushing,actor,Doctor Van Helsing,1.0
1475047,Dracula,1958,Guy Mills,actor,Coach Driver,NaN
1513434,Dracula,1958,Richard (VIII) Morgan,actor,Coach Driver's Companion,NaN
1524497,Dracula,1958,John (II) Mossman,actor,Hearse Driver,NaN

In [111]:
# Cuantos papeles de "Bruce Wayne" han sido hechos en la historia  de las peliculas (papeles hace referencia a la coulumna character)
cast.loc[(cast["character"]== 'Bruce Wayne')].count()

title        38
year         38
name         38
type         38
character    38
n            26
dtype: int64